{"cluster_14": "<strong>->  </strong>In late February, Gregory Greene, an Illinois resident, sued the company in Chicago on behalf of all U.S. residents who paid a trading fee to Mt. Gox and those who had bitcoins or other currency with the exchange when it halted bitcoin withdrawals on February 7.Greene is seeking to recoup millions of dollars lost when the mtgox.com website went down, preventing traders from selling as bitcoin prices plummeted last month.. <br><strong>->  </strong>Banks and nations have fretted over what it could do to traditional currencies and the bankruptcy of Bitcoin exchange Mt. Gox last month is causing further worries over the viability of the currency and the fact that the largest such exchange simply lost or could not find 850,000 Bitcoins priced at the time at around $500 billion.. <br><strong>->  </strong>The hackers claim the under-fire CEO was lying about the amount of bitcoins the exchange had leading to many users of Mt. Gox to claim Karpeles had stolen their bitcoins.. Tokyo-based bitcoin exchange Mt. Gox on Sunday filed for Chapter 15 bankruptcy in the U.S., more than a week after it filed for bankruptcy in Japan and disclosed that it had lost about 750,000 of its customers’ bitcoins.. <br><strong>->  </strong>\n\n\n\nMt. Gox, which filed for bankruptcy protection in Japan in February, said without U.S. protection it would spend substantial funds defending itself against a U.S. lawsuit seeking class action status that was filed in federal court in Chicago.. <br><strong>->  </strong>\n\nRead more on MarketWatch about bitcoin:\n\nWhy the digital currency may be more secure in analog form\n\nHow history explains bitcoin, Mt. Gox bankruptcy\n\nVirtual currency to remain, but is bitcoin the future?.. <b", "cluster_24": "<strong>->  </strong>McDonald’s, the world’s largest restaurant chain, said sales at stores open at least 13 months fell 0.3 percent in February as its U.S. business slumped for the fourth straight month amid harsh weather.. <br><strong>->  </strong>\n\nMcDonald’s has reported nearly two years of turbulent sales at established U.S. restaurants amid sluggish economic growth, increased competition and internal missteps that have complicated its menus and slowed service.. <br><strong>->  </strong>\n\nU.S. sales dropped a full 1.4 percent “amid challenging industry dynamics and severe winter weather,” McDonald’s said in a statement Monday.. <br><strong>->  </strong>Domestic same-store sales slid 1.4 percent, Oak Brook, Illinois-based McDonald’s said in a statement today, while analysts anticipated a drop of 0.6 percent in the U.S.\n\nMcDonald’s, which has more than 14,200 U.S. locations, has been trying to attract Americans with coffee and breakfast foods.. <br><strong>->  </strong>We are diligently focused on strengthening our performance, however our relatively flat year-to-date global comparable sales will pressure margins in the first quarter,” McDonald’s Chief Financial Officer Pete Bensen said\n\nBy contrast, European sales rose 0.6 percent in February thanks to strong performance in the United Kingdom and France, which made up for soft performance in Germany.. <b", "cluster_3": "<strong>->  </strong>In late February, Gregory Greene, an Illinois resident, sued the company in Chicago on behalf of all U.S. residents who paid a trading fee to Mt. Gox and those who had bitcoins or other currency with the exchange when it halted bitcoin withdrawals on February 7.Greene is seeking to recoup millions of dollars lost when the mtgox.com website went down, preventing traders from selling as bitcoin prices plummeted last month.. <br><strong>->  </strong>Banks and nations have fretted over what it could do to traditional currencies and the bankruptcy of Bitcoin exchange Mt. Gox last month is causing further worries over the viability of the currency and the fact that the largest such exchange simply lost or could not find 850,000 Bitcoins priced at the time at around $500 billion.. <br><strong>->  </strong>The hackers claim the under-fire CEO was lying about the amount of bitcoins the exchange had leading to many users of Mt. Gox to claim Karpeles had stolen their bitcoins.. Tokyo-based bitcoin exchange Mt. Gox on Sunday filed for Chapter 15 bankruptcy in the U.S., more than a week after it filed for bankruptcy in Japan and disclosed that it had lost about 750,000 of its customers’ bitcoins.. <br><strong>->  </strong>\n\n\n\nMt. Gox, which filed for bankruptcy protection in Japan in February, said without U.S. protection it would spend substantial funds defending itself against a U.S. lawsuit seeking class action status that was filed in federal court in Chicago.. <br><strong>->  </strong>\n\nRead more on MarketWatch about bitcoin:\n\nWhy the digital currency may be more secure in analog form\n\nHow history explains bitcoin, Mt. Gox bankruptcy\n\nVirtual currency to remain, but is bitcoin the future?.. <b", "cluster_15": "<strong>->  </strong>All out of dough: Sbarro Pizza files for bankruptcy for the second time in three years after struggling with debt and low consumer traffic in shopping malls\n\nSbarro filed for bankruptcy on Monday after struggling with debt and low consumer traffic\n\nLast month, Sbarro said it would close 155 of about 400 restaurants it owns in North America to cut costs\n\nSbarro was founded in Brooklyn, New York in 1956 by Gennaro and Carmela Sbarro, a married couple who had immigrated from Naples, Italy\n\nSbarro LLC, the pizza restaurant chain, on Monday filed for bankruptcy protection for the second time in less than three years, after struggling with too much debt and lower customer traffic in the malls that house many of its restaurants.. <br><strong>->  </strong>It said its filing is designed to “allow for a quick exit from bankruptcy” as it executes a broader plan developed by the new management team.. - Sbarro said Monday that it is filing for bankruptcy reorganization, the struggling pizza chain's second trip through bankruptcy court in less than three years.. <br><strong>->  </strong>\n\nSbarro’s pre-packaged plan\n\nThe pizza restaurant chain operator announced its plan to close 155 out of its 400 restaurants in North America last month as part of its initiative to reduce costs.. <br><strong>->  </strong>\n\nSbarro's US restaurants are mainly located in malls, where foot traffic has slowed and food court spending is down.. <br><strong>->  </strong>\n\nTop management at the franchise restaurant company, which has locations in mall food courts are working to continue to make Sbarro a profitable company.. <b", "cluster_81": "<strong>->  </strong>\n\n\"With colon cancer, it's not so much screening to find early cancers but screening to find polyps and remove them, which prevents cancer,\" said James Church, a colorectal cancer surgeon at the Cleveland Clinic, who wasn't involved in the new study.. <br><strong>->  </strong>The incidence of colon cancer, declining since the mid-1980s, plunged a further 30 percent last decade among Americans 50 and older as more people had colonoscopies, a new study found.. <br><strong>->  </strong>\n\nDespite the dramatic drop, colon cancer remains the third most common cancer and the third leading cause of cancer deaths in the U.S. More than 136,000 new cases develop each year and about 50,000 deaths related to it.. <br><strong>->  </strong>\n\nThe American Cancer Society recommends that people ages 50 and older should receive one of three types of screenings for colon cancer, which include a colonoscopy every 10 years, a stool test every year, or a sigmoidoscopy every five years in combination with stool tests every three to five years.. <br><strong>->  </strong>\n\nScreening tests for breast and prostate cancer have come under fire in recent years for overdiagnosing malignancies—that is, finding a significant number of early cancers that would never cause harm if left untreated, leading to unnecessary treatment.. <b", "cluster_16": "<strong>->  </strong>Gaming Editor Kyle Orland\n\nAn online-only shooter like Titanfall is the kind of game you can only fully evaluate on live servers against the full universe of players, so we won’t have a complete review of the game until later this week.. <br><strong>->  </strong>Respawn Entertainment has confirmed that Titanfall will launch at a native resolution of 792p on Xbox One.. <br><strong>->  </strong>\n\n\"Respawn has shaken up the FPS just as surely as Infinity Ward did with Modern Warfare, and any one of Titanfall's ideas would be a fine starting point for a new era in shooter design.\"\n\nIs Titanfall the next-gen showcase we've been waiting for?. <br><strong>->  </strong>Written by Thomas Chamberlain on March 10, 2014 at 10:47 am\n\nRespawn have today revealed that the Xbox One version of Titanfall will likely see some improvement to the 720p resolution that the game currently has.. <br><strong>->  </strong>\n\nTitanfall is out tomorrow, March 11 on Xbox One and PC.. <b", "cluster_6": "<strong>->  </strong>\n\nMcDonald’s has reported nearly two years of turbulent sales at established U.S. restaurants amid sluggish economic growth, increased competition and internal missteps that have complicated its menus and slowed service.. <br><strong>->  </strong>\n\nU.S. sales dropped a full 1.4 percent “amid challenging industry dynamics and severe winter weather,” McDonald’s said in a statement Monday.. <br><strong>->  </strong>In a near repeat of January’s results, February same-store sales for McDonald’s Corp. (NYSE: MCD) U.S. stores fell and the company’s global sales were rescued by sales in Europe.. <br><strong>->  </strong>McDonald’s, the world’s largest restaurant chain, said sales at stores open at least 13 months fell 0.3 percent in February as its U.S. business slumped for the fourth straight month amid harsh weather.. <br><strong>->  </strong>The fast-food industry also is struggling with shaky consumer confidence and a severe winter that McDonald’s says hurt its U.S. sales last month.. <b", "cluster_50": "<strong>->  </strong>At GDC there is a modified God of War game running on the unit among a number of other experimental demos including cave diving demo called The Deep, medieval combat game The Castle, CCP’s Eve Valkyrie, and Eidos’ Thief.\n\nWhether Morpheus ever sees a commercial release will be down to how much support it gets coupled with how cheap it is to manufacture.. <br><strong>->  </strong>Richard Marks, one of Project Morpheus’s creators, described his own experience with the technology, saying: “When I first experienced presence it shifted my scepticism into complete belief.”\n\nProject Morpheus has been in development for the past three years and is still in prototype form.. <br><strong>->  </strong>\n\nSony also offered up some basic platitudes regarding its overall feelings about virtual reality; that it's a medium unto itself, that it requires its own kind of game art, that it's a social experience, that it can do more than games.. <br><strong>->  </strong>Sony is already working with several game developers, including Crytek and Epic Games, to develop content for Project Morpheus, but the public unveiling at GDC will hopefully entice several more to hop aboard.. <br><strong>->  </strong>Project Morpheus is just a work in progress prototype right now, but one Sony is keen to share with developers and get in-development games supporting.. <b", "cluster_4": "<strong>->  </strong>Gaming Editor Kyle Orland\n\nAn online-only shooter like Titanfall is the kind of game you can only fully evaluate on live servers against the full universe of players, so we won’t have a complete review of the game until later this week.. <br><strong>->  </strong>Respawn Entertainment has confirmed that Titanfall will launch at a native resolution of 792p on Xbox One.. <br><strong>->  </strong>\n\n\"Respawn has shaken up the FPS just as surely as Infinity Ward did with Modern Warfare, and any one of Titanfall's ideas would be a fine starting point for a new era in shooter design.\"\n\nIs Titanfall the next-gen showcase we've been waiting for?. <br><strong>->  </strong>Written by Thomas Chamberlain on March 10, 2014 at 10:47 am\n\nRespawn have today revealed that the Xbox One version of Titanfall will likely see some improvement to the 720p resolution that the game currently has.. <br><strong>->  </strong>\n\nTitanfall is out tomorrow, March 11 on Xbox One and PC.. <b", "cluster_45": "<strong>->  </strong>The case is Mt. Gox Co Ltd, U.S. Bankruptcy Court, Northern District of Texas, No. 14-31229.. (Reuters) - Mt. Gox, once the world’s largest bitcoin exchange, received U.S. bankruptcy protection on Monday to temporarily halt U.S. legal action against the Japanese company by traders who allege the operation was a fraud.. <br><strong>->  </strong>The lawsuit proposes to represent all U.S. residents who paid a trading fee to Mt. Gox and those who had bitcoins or other currency with the exchange when it halted bitcoin withdrawals on February 7.. <br><strong>->  </strong>REUTERS/Jim Urquhart/Files REUTERS/Jim Urquhart\n\nJudge Harlin Hale in Dallas granted temporary bankruptcy protection to Mt. Gox, which had filed for bankruptcy protection in Japan in February.. <br><strong>->  </strong>\n\nHale’s order protects Mt. Gox’s U.S. assets until April, when the parties will return to court and Mt. Gox will seek a permanent stay of U.S. litigation.. <br><strong>->  </strong>An attorney for Coinlab Inc, which sued Mt. Gox in Seattle for breaching a contract last year, said her client was troubled by what appeared to be fraudulent behavior by Karpeles in the days leading up the U.S. bankruptcy filing.. <b", "cluster_21": "<strong>->  </strong>A recent Valve leak of game player counts gives us a very accurate look at PUBG’s total sales on Steam (as of July 1, 2018).. <br><strong>->  </strong>A long, winding road to market\n\nGetting U.S. natural gas on the international market has been a major struggle for producers for years.. <br><strong>->  </strong>\n\nFor example, yes, PUBG did decline a bit in the US lately but it was offset by skyrocketing player base in China and Korea pic.twitter.com/7iIUk5WxBs — Steam Spy (@Steam_Spy) October 11, 2017\n\nWe don’t often see hard numbers like this for the Chinese audience, but it shows just how big games can be over there.. <br><strong>->  </strong>PUBG is already starting to eclipse CS:GO in daily peak players.. <br><strong>->  </strong>\n\nPlayers are not only jumping on the PUBG bandwagon.. <b", "cluster_66": "<strong>->  </strong>\n\nGuest Cast: Amber Riley as Mercedes Jones; Dianna Agron as Quinn Fabray; Mark Salling as Noah “Puck” Puckerman; Heather Morris as Brittany S. Pierce; Harry Shum Jr. as Mike Chang; Kristin Chenoweth as April Rhodes; Gwyneth Paltrow as Holly Holliday; Chace Crawford as Biff McIntosh... <br><strong>->  </strong>The show managed to round up all the old cast members, even if they’ve moved on in real life: Rachel (Lea Michele); Mercedes (Amber Riley); Quinn (Dianna Agron); Brittany (Heather Morris); Santana (Naya Rivera); Puck (Mark Salling); Artie (Kevin McHale); Kurt (Chris Colfer); Blaine (Darren Criss); Becky (Lauren Potter) and Mike (Harry Shum Jr.).. <br><strong>->  </strong>\n\nFirst up, in a Cheerio reunion, Santana (Naya Rivera), Quinn (Dianna Agron), and Brittany (Heather Morris) channel burlesque for a tango-toned Britney Spears “Toxic” remake of a performance from season two.. <br><strong>->  </strong>Fox Broadcasting Co. CR: Adam Rose/FOX\n\nHere’s how FOX describes it:\n\n100 LESSONS, 100 EPISODES AND COUNTLESS MEMORIES ON AN ALL-NEW EPISODE OF “GLEE” TUESDAY, MARCH 18 ON FOX\n\nGwyneth Paltrow Reprises Her Emmy Award-Winning Role as Holly Holiday; Kristin Chenoweth Returns as the Unforgettable April Rhodes; and Chace Crawford (“Gossip Girl”) Guest-Stars in the Milestone 100th Episode\n\nCurrent and past members of New Directions reunite for one final assignment – to reinvent their favorite performances.. <br><strong>->  </strong>\n\n“Valerie” (The Zutons/Amy Winehouse) Video here\n\nOriginal song: Season 2, Episode 9 (November 30, 2010) by Santana and the whole glee club\n\nExcuse for bringing it back: After leaving high school, Brittany is apparently a lab rat at MIT where the scientists marvel at the weird way her brain works (remember, she famously said that dolphins are just gay sharks).. <b", "cluster_2": "<strong>->  </strong>According to a new report from the American Cancer Society, rates of colorectal cancer - commonly called colon cancer - are decreasing steeply among older people in the US because of increasing use of colonoscopy screening, which can detect and remove precancerous growths.. <br><strong>->  </strong>\n\nColorectal cancer, commonly called colon cancer, is the third most common cancer and the third leading cause of cancer death in men and women in the United States.. <br><strong>->  </strong>\n\n\"These continuing drops in incidence and mortality show the lifesaving potential of colon cancer screening; a potential that an estimated 23 million Americans between ages 50 and 75 are not benefiting from because they are not up to date on screening,\" said Richard C. Wender, M.D., American Cancer Society chief cancer control officer.. <br><strong>->  </strong>“Dramatic” progress has been made in reducing colon cancer incidence and death rates in the U.S., but concerns remain about “striking” racial and socio-economic disparities, according to new national statistics on colorectal cancer.. <br><strong>->  </strong>Tell-a-Friend\n\nMONDAY, March 17, 2014 (HealthDay News) -- Americans appear to be winning the war on colon cancer, with a new study finding that colon cancer rates among Americans aged 50 and older fell by about a third from 2000 to 2010.. <b", "cluster_12": "<strong>->  </strong>\n\nGameStop’s used game sales are highly correlated with new game sales, as the latter help replenish the company’s inventory; pre-owned game sales have consistently been around 65% of new software sales for the last four years.. <br><strong>->  </strong>\n\nRead or Share this story: http://usat.ly/1fVX28W. (Adds GameStop share reaction, analyst comments, background)\n\nMarch 18 (Reuters) - Wal-Mart Stores Inc will allow U.S. shoppers to trade in used videogames for anything from groceries to gadgets, a move that could dent the profit of GameStop Corp, the largest dealer of used videogames.. <br><strong>->  </strong>Read more about Sprint and T-Mobile.. (Reuters) - Japan's SoftBank Corp is still trying to buy T-Mobile US Inc and merge it with its U.S. wireless carrier Sprint Corp, SoftBank CEO Masayoshi Son said, even though U.S. regulators appear set against a deal.. <br><strong>->  </strong>(Photo: Ethan Miller, Getty Images)\n\nShares of GameStop plunged 5% in morning trading on Tuesday after Wal-Mart announced it was entering a prime space for the video game chain: used games.. <br><strong>->  </strong>\n\nWal-Mart said on Tuesday its trade-in service will accept games for popular consoles like the Sony Corp’s PlayStation3 and Microsoft Corp’s Xbox 360, and customers can in return buy anything at Walmart and Sam’s Club.\n\n“Gaming continues to be an important business for us and we’re actively taking aim at the $2 billion pre-owned videogame opportunity,” Duncan Mac Naughton, chief merchandising and marketing officer for Walmart U.S., said in a statement.. <b", "cluster_94": "<strong>->  </strong>\n\n'Hearing Pono for the first time is like that first blast of daylight when you leave a movie theatre on a sun-filled day.'\n\nNeil Yioung said 'We want to move digital music into the 21st century and PonoMusic does exactly that'\n\n'Our mission is to bring the highest-quality digital music to discerning, passionate consumers, who wish to experience music the way the artists intended, with emotion, detail and power intact,' the firm says.. <br><strong>->  </strong>\n\nSeveral companies have begun offering players and downloads of high resolution digital music which restores much of the data lost when music files are compressed into MP3 format.. <br><strong>->  </strong>The Canadian-born musician, a longtime critic of the quality of digital music, said he would be launching an online store for music downloads as well as a portable player through his new company, PonoMusic.. <br><strong>->  </strong>\n\nThe $399 Pono Player will play high quality audio files, and each player can hold between 100 and 500 songs\n\n'It's about the music, real music,' said said Neil Young, founder and chairman of PonoMusic.. <br><strong>->  </strong>Neil Young reveals plan to take a bite out of Apple with $399 PonoMusic player and download store\n\nPonoPlayer to offer superior sound quality to Apple's downlaodable files\n\nAims to recreate the sound quality of vinyl in a digital download\n\nWill require users to buy their music again in new format\n\n\n\nLegendary musician Neil Young has revealed plans for a high end digital music player and download service to take on Apple.. <b", "cluster_56": "<strong>->  </strong>In X-Men: Days of Future Past, the most loved characters from the original X-Men film trilogy join forces with their younger selves from X-Men: First Class, in an epic battle that must change the past to save the future!. <br><strong>->  </strong>One of the most anticipated films of summer 2014 is X-Men Days of Future Past, which is based on the famous story arc from the X-Men comics written by Chris Claremont.. <br><strong>->  </strong>\n\nMichael Fassbender, James McAvoy, Ian McKellen and Patrick Stewart all set to appear, playing different versions of the characters Professor X and Magneto, and they will be joined by Jennifer Lawrence, Hugh Jackman, Halle Berry, Nicholas Hoult, Peter Dinklage and Ellen Page.. <br><strong>->  </strong>\n\nWatch the super awesome trailer of X-Men: Days of Future Past here:\n\n. <br><strong>->  </strong>The X-Men series has a lot riding on this movie as the previous part X-Men: The Last Standing received quite lukewarm reviews.. <b", "cluster_54": "<strong>->  </strong>\n\nThe Hollywood hunk shot to fame on the Disney franchise in the late 2000s, alongside his co-stars Vanessa Hudgens, Ashley Tisdale and Corbin Bleu, but the castmates went their separate ways following the big screen release of 2008's High School Musical 3: Senior Year.. <br><strong>->  </strong>\n\nEfron has been in a number of films since the Disney musical premiered in theaters but, in a new interview with an E! News reporter at this year's SXSW event, he says he would \"100 percent\" do a reunion \"High School Musical\" movie.. <br><strong>->  </strong>Actor Zac Efron is keen to return to his High School Musical roots for another round of the all-singing, all-dancing films.. <br><strong>->  </strong>\n\nEfron, who was propelled to fame by the franchise, portrayed basketball star Troy Bolton, who finds himself in a Romeo-and-Juliet type romance with transfer student Gabriella Montez, played by Vanessa Hudgens... <br><strong>->  </strong>\n\nEfron has since managed to carve out a career for himself in films like New Year's Eve, The Lucky One, The Paperboy and That Awkward Moment, but he admits he'd love to reunite onscreen with his old pals for another High School Musical outing - and he's not the only one.. <b", "cluster_49": "<strong>->  </strong>\n\n\"Comedy is a big part of our schedule, and The Big Bang Theory is the biggest comedy force on television,\" said CBS Entertainment chairman Nina Tassler.. <br><strong>->  </strong>“This multi-year deal further strengthens our network’s position for future seasons and marks another chapter in the great partnership CBS enjoys with [show producer] Warner Bros. Television for delivering audiences the best in comedy.. <br><strong>->  </strong>While many shows see a drop off in viewers after the first handful of seasons, The Big Bang Theory has been wildly successful and has brought in an average of 20 million viewers per season the past two seasons.. <br><strong>->  </strong>\n\nBig Bang Theory has powered a Thursday night CBS block that has hit both Fox and NBC hard in the US, cutting deeply into the ratings for American Idol and thwarting NBC’s attempts to recapture its longstanding place as the Thursday-night destination for comedy.. <br><strong>->  </strong>The series is currently in its seventh season, and has been pulling in record viewers for CBS, while stars Jim Parsons, Johnny Galecki, Kaley Cuoco-Sweeting, Simon Helberg and Kunal Nayyar are currently in negotiations about extending their contracts with what will surely be wallet-bursting deals for Warner Bros. Television.. <b", "cluster_80": "<strong>->  </strong>According to a new report from the American Cancer Society, rates of colorectal cancer - commonly called colon cancer - are decreasing steeply among older people in the US because of increasing use of colonoscopy screening, which can detect and remove precancerous growths.. <br><strong>->  </strong>\n\n\"These continuing drops in incidence and mortality show the lifesaving potential of colon cancer screening; a potential that an estimated 23 million Americans between ages 50 and 75 are not benefiting from because they are not up to date on screening,\" said Richard C. Wender, M.D., American Cancer Society chief cancer control officer.. <br><strong>->  </strong>\n\nColorectal cancer, commonly called colon cancer, is the third most common cancer and the third leading cause of cancer death in men and women in the United States.. <br><strong>->  </strong>The article and its companion report, Colorectal Cancer Facts & Figures, were released today by American Cancer Society researchers as part of a new initiative by the National Colorectal Cancer Roundtable to increase screening rates to 80 percent by 2018.. <br><strong>->  </strong>The authors suggest the sharper fall in colon cancer rates among seniors - who become eligible for Medicare when they turn 65 - is likely due to higher take up of screening because of universal insurance coverage:\n\n\"In 2010, 55% of adults aged 50 to 64 years reported having undergone a recent colorectal cancer screening test, compared with 64% of those aged 65 years and older.. <b", "cluster_9": "<strong>->  </strong>\n\nIf study results are consistent with previous studies showing health benefits of eating cocoa flavanols, it will be a semi-sweet outcome for chocolate lovers.. <br><strong>->  </strong>In previous studies, cocoa flavanols have been found to improve blood pressure, cholesterol, insulin levels, and artery health, among other things, but this is the first large study to look at them.. <br><strong>->  </strong>‘Cocoa flavanols are often destroyed by processing.’\n\nParticipants will get dummy pills or two capsules a day of cocoa flavanols for four years, and neither they nor the study leaders will know who is taking what during the study.. <br><strong>->  </strong>But instead of eating chocolate bars every day, the study participants will take capsules containing concentrated amounts of the bio-active chemicals in cocoa beans, known as cocoa flavanols.. <br><strong>->  </strong>It won’t be nearly as much fun as eating chocolate bars, but a big study is being launched to see if pills containing the nutrients in dark chocolate can help prevent heart attacks and strokes.. <b", "cluster_11": "<strong>->  </strong>\n\nThe Spritz Web page explains what makes Spritz different from other speed reading systems: “There are lots of other reading techniques out there such as skimming (not reading every word), avoiding sub-vocalization (talking to yourself while reading) and enlarging the peripheral span (reading an entire page at a time by mental “snapshot”) that attempt to increase reading speeds.. <br><strong>->  </strong>Spritz provides proprietary algorithms to identify how long to display words and sentences, providing an unparalleled natural reading experience.\"\n\nTry Out A Sprtiz Session here and read at speeds up to 500 WPM\n\nSpritz Increases Traditional Reading Speed\n\n\"When we started testing, we already knew that we were on to something but the comprehension tests surprised even us,\" said Maik Maurer, Co-Founder and CTO of Spritz.. <br><strong>->  </strong>By applying their new method of word alignment that's based on the science of how people traditionally recognize words while reading, Spritz takes eye movement out of the equation, allowing much more to be read in the same amount of time.. <br><strong>->  </strong>A new bt of mobile tech called Spritz, coming to the Samsung Galaxy S5 and Gear 2 smart watches, provides a clever way of doing just that, by flashing words at you rapid-fire at speeds up to 1,000 words-per-minute (wpm).. <br><strong>->  </strong>\n\nAdvertisement - Continue Reading Below\n\n\n\nThe technology works by presenting words on the screen one-by-one in rapid succession, ranging from speeds of 250 words per minute to as high as 1,000 words - nearly five times the normal reading speed of 220 words a minute.. <b", "cluster_41": "<strong>->  </strong>The deal would combine Sprint and T-Mobile in some form of merger and help bring them in to a “real fight” with AT&T and Verizon.. <br><strong>->  </strong>\n\nWe’ve been hearing for months about a supposed bid for T-Mobile by SoftBank CEO, Masayoshi Son, but haven’t heard anything officially confirming the interest.. <br><strong>->  </strong>In a television interview yesterday evening, Sprint Chairman, and SoftBank CEO, Masayoshi Son confirmed that he was interested in a deal to buy T-Mobile.. <br><strong>->  </strong>A similar move was made by Vodafone, shortly after the announcement was made that it would sell its 45% share in Verizon back to the American wireless carrier.. <br><strong>->  </strong>If a merger goes through, let’s hope that Son decides Legere should stay on as CEO, and T-Mobile swallows up Sprint.. <b", "cluster_42": "<strong>->  </strong>\n\nHTC One (M8) vs iPhone 5s: Design\n\nHTC won many admirers for the design of the HTC One last year, with most pointing to the use of premium materials like aluminium and glass over the plastic used by Samsung in its Galaxy devices.. <br><strong>->  </strong>Share\n\nWe all knew it was coming, and we already know a lot about it – but in an interesting twist on the “officially announce it, and then wait a couple of weeks” we’re used to with new phones, the HTC One (M8) – a refreshed version of HTC’s flagship handset is apparently now available in six Carphone Warehouse stores… having been driven straight from the venue where they announced it.. <br><strong>->  </strong>The previous version, the HTC One (M7), was the Taiwanese company’s most successful phone to date, winning a host of awards including best phone of the year at this year’s Mobile World Congress.. <br><strong>->  </strong>\n\nIssues with supply chain and distribution also hindered sales of the M7 and as a result, HTC’s market share for smartphones fell from 3.9 per cent in 2010 to 1.7 per cent last year in the Middle East, according to IDC amid stiff competition from Samsung, Apple and cheaper Chinese brands such as Lenovo and Huawei.. <br><strong>->  </strong>Read more about Sprint and T-Mobile.. (Reuters) - Japan's SoftBank Corp is still trying to buy T-Mobile US Inc and merge it with its U.S. wireless carrier Sprint Corp, SoftBank CEO Masayoshi Son said, even though U.S. regulators appear set against a deal.. <b", "cluster_43": "<strong>->  </strong>\n\nRoughly 27 percent, or $2.4 billion, of its total revenue of $8.9 billion in the year ended Jan. 31, 2013, came from used video games, the company said.. GameStop Corp. (NYSE: GME) has had a challenging time from attacks on its business on all fronts — online sales, freemium games versus premium games, and big-box retail efforts.. <br><strong>->  </strong>\n\nGameStop’s used game sales are highly correlated with new game sales, as the latter help replenish the company’s inventory; pre-owned game sales have consistently been around 65% of new software sales for the last four years.. <br><strong>->  </strong>(Photo: Ethan Miller, Getty Images)\n\nShares of GameStop plunged 5% in morning trading on Tuesday after Wal-Mart announced it was entering a prime space for the video game chain: used games.. <br><strong>->  </strong>Wal-Mart also offers games and consoles at its stores but has so far been unable to take market share from GameStop.. <br><strong>->  </strong>\n\nWhile GameStop would be unlikely to lose market share, the company would be forced to go into a price war to both buy used games and to sell the refurbished games, according to Stifel analyst David Schick.. <b", "cluster_5": "<strong>->  </strong>Sara Castellanos\n\nTechnology Reporter- Boston Business Journal\n\n\n\nA robotic fish that's capable of mimicking the rapid movements of a real fish could be swimming alongside schools of live fish in coral reefs by the summer, said MIT researcher Daniela Rus.. <br><strong>->  </strong>redOrbit Staff & Wire Reports – Your Universe Online\n\nThe research popularity of soft robots, which are robots with soft exteriors powered by fluid flowing through flexible channels, has grown to such an extent that a new journal has been created about the topic – Soft Robotics (SoRo), a peer-reviewed journal from Mary Ann Liebert, Inc., publishers.. <br><strong>->  </strong>I designed for it to look like a fish, but we got the same inherent parameter decoupling that real fish have.”\n\nRus said this highlights another possible application of soft robotics – biomechanics.. <br><strong>->  </strong>\n\n\n\n“We’re excited about soft robots for a variety of reasons,” says Daniela Rus, a professor of computer science and engineering, director of MIT’s Computer Science and Artificial Intelligence Laboratory, and one of the researchers who designed and built the fish.. <br><strong>->  </strong>\n\n\n\nAnother reason to study soft robots, Rus says, is that “with soft machines, the whole robotic planning problem changes.”. <b"}