{"cluster_46": "<strong>->  </strong>All out of dough: Sbarro Pizza files for bankruptcy for the second time in three years after struggling with debt and low consumer traffic in shopping malls\n\nSbarro filed for bankruptcy on Monday after struggling with debt and low consumer traffic\n\nLast month, Sbarro said it would close 155 of about 400 restaurants it owns in North America to cut costs\n\nSbarro was founded in Brooklyn, New York in 1956 by Gennaro and Carmela Sbarro, a married couple who had immigrated from Naples, Italy\n\nSbarro LLC, the pizza restaurant chain, on Monday filed for bankruptcy protection for the second time in less than three years, after struggling with too much debt and lower customer traffic in the malls that house many of its restaurants.. <br><strong>->  </strong>It said its filing is designed to “allow for a quick exit from bankruptcy” as it executes a broader plan developed by the new management team.. - Sbarro said Monday that it is filing for bankruptcy reorganization, the struggling pizza chain's second trip through bankruptcy court in less than three years.. <br><strong>->  </strong>\n\nSbarro’s pre-packaged plan\n\nThe pizza restaurant chain operator announced its plan to close 155 out of its 400 restaurants in North America last month as part of its initiative to reduce costs.. <br><strong>->  </strong>\n\nSbarro's US restaurants are mainly located in malls, where foot traffic has slowed and food court spending is down.. <br><strong>->  </strong>\n\nTop management at the franchise restaurant company, which has locations in mall food courts are working to continue to make Sbarro a profitable company.. <b", "cluster_45": "<strong>->  </strong>U.S. creditors can contest Mt. Gox's request for Chapter 15 protection.\"\n\nOn Sunday, hackers hijacked Mt. Gox CEO Mark Karpeles' personal blog and accused him of lying about Bitcoins being stolen.. <br><strong>->  </strong>Karpeles also stated that the business challenges they faced were substantial denial of service attacks which forced them to shut down several times, and which ultimately led to the theft of hundreds of thousands of bitcoins owned by Mt. Gox customers and Mt. Gox itself.. <br><strong>->  </strong>Following that, late on Sunday, troubled Mt. Gox filed for bankruptcy protection in the U.S., which follows a previous filing in Japan in February for bankruptcy protection.. <br><strong>->  </strong>\n\nOn Saturday, a new document posted to the MtGox website warned (PDF) of phishing e-mails that ask for usernames, passwords, and banking details.. \n\nMichael Liedtke, The Associated Press\n\n\n\n\n\nThe collapse of Japan's Mt. Gox bitcoin exchange is spilling into U.S. bankruptcy court as the company scrambles for legal cover after losing digital currency valued at $473 million.. <br><strong>->  </strong>The lawsuit proposes to represent all U.S. residents who paid a trading fee to Mt. Gox and those who had bitcoins or other currency with the exchange when it halted bitcoin withdrawals on Feb. 7.. <b", "cluster_27": "<strong>->  </strong>Written by Thomas Chamberlain on March 10, 2014 at 10:47 am\n\nRespawn have today revealed that the Xbox One version of Titanfall will likely see some improvement to the 720p resolution that the game currently has.. <br><strong>->  </strong>Respawn Entertainment has confirmed that Titanfall will launch at a native resolution of 792p on Xbox One.. <br><strong>->  </strong>Gaming Editor Kyle Orland\n\nAn online-only shooter like Titanfall is the kind of game you can only fully evaluate on live servers against the full universe of players, so we won’t have a complete review of the game until later this week.. <br><strong>->  </strong>\n\nTitanfall is out tomorrow, March 11 on Xbox One and PC.. <br><strong>->  </strong>Microsoft has been pushing out major updates to the Xbox One’s operating system to address issues in time for Titanfall’s launch.. <b", "cluster_28": "<strong>->  </strong>The games developer said if Flappy Bird makes a return it will come with a warning [GETTY]\n\nRelated articles Flappy Bird: Creator Dong Nguyen considers bringing back game to Apple iPhone and Android\n\nI'm considering it Flappy Bird creator Dong Nguyen\n\nIt was suddenly removed from smartphone stores on February 9.. <br><strong>->  </strong>In an extensive interview with Rolling Stone, Flappy Bird creator Dong Nguyen says he is \"considering\" whether to relaunch his hit game on Apple's iOS and Google's Android devices, one month after abruptly removing the game.. <br><strong>->  </strong>\n\nFlappy Bird creator Dong Nguyen revealed to Rolling Stone that he's considering bringing back the highly-addictive game.. <br><strong>->  </strong>\n\n\"The reason Flappy Bird is so popular is that it happens to be something different from mobile games today, and is a really good game to compete against each other,\" Nguyen told The Verge.. <br><strong>->  </strong>The crazily popular game of recent time, Flappy Bird, might just make a comeback in App and Play stores, indicates developer Dong Nguyen.. <b", "cluster_17": "<strong>->  </strong>\n\nSimon Helberg and Kunal Nayyar are said looking for increases too and will negotiate together, while Mayim Bialik and Melissa Rauch have inked new deals with WBTV.. CBS has given a vote of confidence to Emmy-winning comedy ‘The Big Bang Theory’ starring Jim Parsons, Kaley Cuoco, Johnny Galecki, reported Ace Showbiz.. <br><strong>->  </strong>\n\n\n\nThe cast of the sitcom will stay together for at least ten seasons\n\n\"Comedy is a big part of our schedule, and The Big Bang Theory is the biggest comedy force on television,\" Nina Tassler, CBS Entertainment Chairman Nina Tassler, said in a press release Wednesday.. <br><strong>->  </strong>“This multi-year deal further strengthens our network’s position for future seasons and marks another chapter in the great partnership CBS enjoys with [show producer] Warner Bros. Television for delivering audiences the best in comedy.. <br><strong>->  </strong>While many shows see a drop off in viewers after the first handful of seasons, The Big Bang Theory has been wildly successful and has brought in an average of 20 million viewers per season the past two seasons.. <br><strong>->  </strong>\n\nBig Bang Theory has powered a Thursday night CBS block that has hit both Fox and NBC hard in the US, cutting deeply into the ratings for American Idol and thwarting NBC’s attempts to recapture its longstanding place as the Thursday-night destination for comedy.. <b", "cluster_3": "<strong>->  </strong>\"\n\nGame of Thrones will return to HBO on April 6.. “Game of Thrones” might not be returning to HBO with its fourth season until April 6th, but that hasn’t stopped the fantasy series from leaking a teasing promo to get us prepared!. <br><strong>->  </strong>A new trailer of \"Game of Thrones\" season 4 was aired on HBO just before the finale season of \"True Detective\" on Sunday and fans are thrilled with what they saw.. <br><strong>->  </strong>HBO has released the third trailer for its upcoming fourth season of \"Game of Thrones.. <br><strong>->  </strong>\n\n__________________________________________________\n\nGame of Thrones season 4 begins airing on HBO on April 6th, 2014.. <br><strong>->  </strong>\n\nAre you excited for Season 4 of “Game of Thrones”?. <b"}