{"cluster_13": "<strong>->  </strong>\n\nWe live in an era where the very concept of truth is politicized; where policy-makers and voters and journalists stand in denial of demonstrable science in favor of magical thinking and faith; where science warped by dogma is given equal footing in classrooms and Congress; where \"teaching the controversy\" forces educators to lend false weight to bad science in the name of religion and tradition.. <br><strong>->  </strong>But perhaps Tyson’s Cosmos can continue to use stories like Bruno’s to assert a simple theological truth that millions of Christians have known for centuries: science might be a threat to intolerant religious people, but God and science are anything but incompatible.. <br><strong>->  </strong>\"Science, as it is communicated to the public typically, is through the lens of discovery, but in fact, science is a process,\" Tyson told an audience last July.. <br><strong>->  </strong>It might sound crazy, but the recent reboot of the television show Cosmos: A Personal Journey — Carl Sagan’s classic 1980s exploration of all things science, this time starring the charismatic Tyson and renamed “Cosmos: A Spacetime Odyssey” — is already attracting more attention for what it says about religion than astrophysics.. <br><strong>->  </strong>Reddit Digg Stumbleupon Linkedin\n\nSome are crying foul at the opening episode of the much-anticipated reboot of the Carl Sagan science program \"Cosmos.\"\n\nHosted by astrophysicist Neil deGrasse Tyson, Sunday's debut episode featured an animated segment on the persecution of Giordano Bruno, a 16th-century monk and astronomer.. <b", "cluster_3": "<strong>->  </strong>The Bachelor 18 'The Bachelor' star Juan Pablo Galavis selects Nikki Ferrell as his final bachelorette and gives her a rose -- but that's it!\n\nBy Elizabeth Kwiatkowski, 03/11/2014\n\n\n\nstar\n\n\n\nADVERTISEMENT Nikki, a 26-year-old pediatric nurse from Kansas City, MO, received Juan Pablo's final rose and the phrase, \"I like you a lot,\" from star.. <br><strong>->  </strong>\n\n\n\n\"You have to go with how you feel at the time and the information you have at the time, and, for us, Juan Pablo was easily the best choice at the time,\" Harrison tells TVGuide.com\n\n\n\nHeading into the January season premiere, ABC played up Juan Pablo's Latin background with its \"Juan-uary\" promos.. <br><strong>->  </strong>\n\n\n\n\n\nFOLLOW REALITY TV WORLD ON GOOGLE NEWS star Juan Pablo Galavis picked Nikki Ferrell as his final bachelorette -- but didn't propose marriage or reveal his love to her -- during Monday night's finale broadcast of the eighteenth season of the ABC reality dating show.. <br><strong>->  </strong>\"\n\n\n\nClare was the first woman to meet\n\n\n\nClare trusted Juan Pablo and knew everything was going to be okay, because he had always promised her that.. <br><strong>->  </strong>\n\n\n\nA couple weeks later, viewers were talking about Juan Pablo's late-night swim with Clare, which Juan Pablo later used to shame her.. <b", "cluster_9": "<strong>->  </strong>\n\nNot long after the leak, which might have come from disgruntled former Mt. Gox employees, individuals claiming to be Mt. Gox customers took to Twitter to say that they opened the zip file and were able to confirm their own account balances based on their user Mt. Gox IDs issued in their initial Mt. Gox registration email.. <br><strong>->  </strong>Banks and nations have fretted over what it could do to traditional currencies and the bankruptcy of Bitcoin exchange Mt. Gox last month is causing further worries over the viability of the currency and the fact that the largest such exchange simply lost or could not find 850,000 Bitcoins priced at the time at around $500 billion.. <br><strong>->  </strong>At the time, Mt. Gox Chief Executive Officer Mark Karpeles said bitcoins were lost \"due to weaknesses in the system,\" and Mt. Gox since filed for bankruptcy in Japan.. <br><strong>->  </strong>The hackers initially posted to Karpeles's website a 716MB file of stolen data from Mt. Gox's servers; it included a spreadsheet of more than a million trades, the company's balance in 18 currencies (including bitcoin), administrative access to Gox parent company Tibanne Limited, and a screenshot of the hackers' access, as well as a list of Karpeles's home addresses and personal resume.. <br><strong>->  </strong>\n\nOver the weekend, furious bitcoin users hacked the website of Mt. Gox CEO Mark Karpeles, posting data that appears to show that the exchange still holds customer investments in the millions of dollars.. <b", "cluster_55": "<strong>->  </strong>next Image 1 of 3\n\nprev next Image 2 of 3\n\nprev Image 3 of 3\n\nAnonymous hackers claim to have published evidence that Mt. Gox CEO Mark Karpeles lied about the theft of more than $500 million worth of bitcoin.. <br><strong>->  </strong>At the time, Mt. Gox Chief Executive Officer Mark Karpeles said bitcoins were lost \"due to weaknesses in the system,\" and Mt. Gox since filed for bankruptcy in Japan.. <br><strong>->  </strong>Mt Gox collapse shatters Bitcoin myth of virtual money By Peter Morici\n\nBitcoin believers were shaken to their digital souls when Mt. Gox, the world’s largest exchange, defaulted on $470 million worth of deposits and closed.. <br><strong>->  </strong>\n\nThe attacks on MtGox lasted for several days and many Bitcoins were stolen, the Yomiuri said.. <br><strong>->  </strong>But regulators in Europe, Japan and the U.S. are moving quickly in the aftermath of the Mt. Gox collapse to rein in Bitcoin trading, requiring Bitcoin banks and trading houses to make detailed records of trades and report high-value transactions just as conventional financial institutions are required to do.. <b", "cluster_28": "<strong>->  </strong>A non-exhaustive and example list of currencies capable of being exchanged may include frequent flyer miles, loyalty and reward points (e.g., credit card reward points, hotel loyalty points, retail loyalty points), virtual currency, cash, Bitcoins, Facebook credits, eBay bucks, cash-equivalent currency (e.g., gift cards, travelers checks, cashier's checks), and any other form of currency…\"\n\nThe problem, to be clear, has to do with the fact that online digital currency exchanges are terribly insecure, entirely unregulated and completely uninsured.. <br><strong>->  </strong>What Bitcoin doesn’t do, though, is address the issues that arise when tens, hundreds, or thousands of digital currencies are on the market and people want to trade those digital currencies for other digital currencies, or for fiat currencies.... <br><strong>->  </strong>After what has been a rough few months for Bitcoin, it's great to see that there might be huge and positive advances with regard to online exchanges in the near future; eBay or otherwise, digital currencies need better, trustworthy exchanges in order for current and future users to better trust the currencies themselves... <br><strong>->  </strong>The Japanese government issued a statement earlier this week that it does not prohibit financial firms from investing funds in bitcoin, but they are banned from exchanging between bitcoins and conventional currencies.. <br><strong>->  </strong>What every article is essentially explaining though is that the Peer-to-Peer structure of Bitcoin (and, in theory, digital currencies using similar code,) solves what is called the Byzantine Generals’ Problem (also called the Two Generals’ Problem or Byzantine fault tolerance).By allowing computers all over the world to assist in providing hashes (essentially transactions stamps) which are then sent to what is called the block-chain (a massive public ledger of all Bitcoin transactions), the decentralized system works to ensure that each transaction between a Bitcoin holder and Bitcoin recipient is unique.. <b", "cluster_56": "<strong>->  </strong>Mt. Gox files for US bankruptcy amid new hacker claims\n\nHacked bitcoin exchange Mt. Gox has filed for Chapter 15 bankruptcy protection in the US, having already filed in Japan last month, and seen its CEO’s blog vandalized with claims of exactly how much of investors’ virtual cash was lost.. <br><strong>->  </strong>\n\nOver the weekend , anonymous hackers claimed to have broken in to Mt. Gox systems and lifted apparent evidence that customer investments were not the target of theft, but instead are still being held at the exchange as part of a fraudulent plot by Mt. Gox management. <br><strong>->  </strong>\n\nRead more on MarketWatch about bitcoin:\n\nWhy the digital currency may be more secure in analog form\n\nHow history explains bitcoin, Mt. Gox bankruptcy\n\nVirtual currency to remain, but is bitcoin the future?.. <br><strong>->  </strong>Banks and nations have fretted over what it could do to traditional currencies and the bankruptcy of Bitcoin exchange Mt. Gox last month is causing further worries over the viability of the currency and the fact that the largest such exchange simply lost or could not find 850,000 Bitcoins priced at the time at around $500 billion.. <br><strong>->  </strong>\n\nOver the weekend, furious bitcoin users hacked the website of Mt. Gox CEO Mark Karpeles, posting data that appears to show that the exchange still holds customer investments in the millions of dollars.. <b"}